src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <comment>Заявки на поставку предметов снабжения</comment>
  <posting>Deny</posting>
  <attributes>
    <name>НомерЗаказчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииЗаявокНаПоставкуПС</types>
    </type>
  </attributes>
  <attributes>
    <name>Корабли</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозиций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроектаВТС</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаЗаявки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНазначенияДЗО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительДЗО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженаССайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТекущийЭтап</name>
    <type>
      <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаТекущегоЭтапа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросТКПRFP</name>
    <type>
      <types>DocumentRef.ЗапросТКПRFP</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистДЭ</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удалить_ЭтапыВыполненияЗаявки</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияЗаявокНаПоставкуПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.СтруктураЗаказаПоКомплектующимИзделиямИЗИП</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПредметаСнабженияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзделияЗаказчика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсполнительДЗО</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОСК</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИерархииИзделия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекущегоЭтапа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыВыполненияСпецификации</name>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыВыполненияПунктовЗаявок</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Корабль</name>
      <type>
        <types>CatalogRef.ПроектыКораблей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ЦеныПредметовСнабжения/ЦеныПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПредметовСнабжения</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦены</name>
    <type>
      <types>EnumRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.КлючиАналитикиЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеПоставки</name>
    <type>
      <types>CatalogRef.УсловияПоставок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыЦен/ТипыЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЦен</name>
  <enumValues>
    <name>Внутренняя</name>
  </enumValues>
  <enumValues>
    <name>Внешняя</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыКонтрактов/ТипыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрактов</name>
  <enumValues>
    <name>Контракт</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>ТКП</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Заказы/Заказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказы</name>
  <comment>Поставленные Заказы (по флотам РФ и по Заказчикам)</comment>
  <owners>Catalog.ПроектыКораблей</owners>
  <attributes>
    <name>БортовойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Флоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостройки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Строитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТехническиеХарактеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вооружение</name>
    <attributes>
      <name>Вооружение</name>
      <type>
        <types>CatalogRef.ВооружениеКораблей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Заявка/ManagerModule.bsl
///////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = "Заявка № " + Данные.НомерЗаказчика + " от " + Формат(Данные.Дата, "ДФ=dd.MM.yyyy");
	
КонецПроцедуры	//ОбработкаПолученияПредставления

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("НомерЗаказчика");
	Поля.Добавить("Дата");
	
КонецПроцедуры	//ОбработкаПолученияПолейПредставления

#Область ПечатьЗаявки
Функция ПолучитьСтрокуПроектов(ПредметИсточник, Проекты)
	
	Ответ = "";
	
	НайденныеСтроки = Проекты.НайтиСтроки(Новый Структура("ПредметСнабжения",ПредметИсточник)); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого стрПроект Из НайденныеСтроки Цикл
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				Ответ = Ответ + ", ";
			КонецЕсли;
			
			Ответ = Ответ + стрПроект.Проект;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции // ПолучитьСтрокуПроектов()

Функция ПолучитьСтрокуАналог(ПредметИсточник, Аналоги)
	
	Ответ = "";
	
	НайденныеСтроки = Аналоги.НайтиСтроки(Новый Структура("ПредметСнабжения",ПредметИсточник)); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого нСтрока Из НайденныеСтроки Цикл
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				Ответ = Ответ + ", ";
			КонецЕсли;
			
			Ответ = Ответ + нСтрока.АналогНаименование;
			
			Если ЗначениеЗаполнено(нСтрока.АналогОбозначение) Тогда
				Ответ = Ответ + нСтрока.АналогОбозначение;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции	//ПолучитьСтрокуАналог

Функция ПолучитьСтрокуПоставщик(ПредметИсточник, Поставщик)
	
	Ответ = "";
	
	НайденныеСтроки = Поставщик.НайтиСтроки(Новый Структура("ПредметСнабжения",ПредметИсточник)); 
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого нСтрока Из НайденныеСтроки Цикл
			
			Если ЗначениеЗаполнено(Ответ) Тогда
				Ответ = Ответ + ";" + Символы.ПС;
			КонецЕсли;
			
			Ответ = Ответ + нСтрока.Контрагент;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции	//ПолучитьСтрокуАналог

Функция ВыполнитьПакетныйЗапросПечати(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	ЗаявкаСпецификация.ПредметСнабжения КАК ПредметСнабжения,
		|	ЗаявкаСпецификация.НаименованиеПредметаСнабженияЗаказчика КАК НаименованиеПСИзЗаявки,
		|	ВЫБОР
		|		КОГДА ЗаявкаСпецификация.ПредметСнабжения = ЗНАЧЕНИЕ(Справочник.КаталогПредметовСнабжения.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЗаполнятьДанные,
		|	ЗаявкаСпецификация.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ПредметыСнабжения
		|ИЗ
		|	Документ.Заявка.Спецификация КАК ЗаявкаСпецификация
		|ГДЕ
		|	ЗаявкаСпецификация.Ссылка = &Заявка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПредметСнабжения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Владелец КАК Проект,
		|	ВТ_ПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения
		|ИЗ
		|	ВТ_ПредметыСнабжения КАК ВТ_ПредметыСнабжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Заказы КАК Заказы
		|			ПО СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = Заказы.Ссылка
		|		ПО ВТ_ПредметыСнабжения.ПредметСнабжения = СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения
		|ГДЕ
		|	Заказы.Заказчик = &Флот
		|	И ВТ_ПредметыСнабжения.ЗаполнятьДанные
		|	И Заказы.Владелец <> &Неопределено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КаталогПредметовСнабженияАналоги.Ссылка КАК ПредметСнабжения,
		|	КаталогПредметовСнабженияАналоги.Аналог.Наименование КАК АналогНаименование,
		|	КаталогПредметовСнабженияАналоги.Аналог.Обозначение КАК АналогОбозначение
		|ИЗ
		|	ВТ_ПредметыСнабжения КАК ВТ_ПредметыСнабжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.Аналоги КАК КаталогПредметовСнабженияАналоги
		|		ПО ВТ_ПредметыСнабжения.ПредметСнабжения = КаталогПредметовСнабженияАналоги.Ссылка
		|			И (ВТ_ПредметыСнабжения.ЗаполнятьДанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка КАК ПредметСнабжения,
		|	КаталогПредметовСнабженияИзготовителиИПоставщики.Контрагент КАК Контрагент
		|ИЗ
		|	ВТ_ПредметыСнабжения КАК ВТ_ПредметыСнабжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.ИзготовителиИПоставщики КАК КаталогПредметовСнабженияИзготовителиИПоставщики
		|		ПО ВТ_ПредметыСнабжения.ПредметСнабжения = КаталогПредметовСнабженияИзготовителиИПоставщики.Ссылка
		|ГДЕ
		|	(КаталогПредметовСнабженияИзготовителиИПоставщики.Поставщик
		|			ИЛИ КаталогПредметовСнабженияИзготовителиИПоставщики.Изготовитель)
		|	И ВТ_ПредметыСнабжения.ЗаполнятьДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныПредметовСнабженияСрезПоследних.Контрагент КАК Контрагент,
		|	ЦеныПредметовСнабженияСрезПоследних.Цена КАК Цена,
		|	ЦеныПредметовСнабженияСрезПоследних.Валюта КАК Валюта,
		|	ЦеныПредметовСнабженияСрезПоследних.Период КАК Период,
		|	ЦеныПредметовСнабженияСрезПоследних.ПредметСнабжения КАК ПредметСнабжения
		|ИЗ
		|	РегистрСведений.ЦеныПредметовСнабжения.СрезПоследних(
		|			,
		|			ПредметСнабжения В
		|					(ВЫБРАТЬ
		|						ВТ_ПредметыСнабжения.ПредметСнабжения
		|					ИЗ
		|						ВТ_ПредметыСнабжения
		|					ГДЕ
		|						ВТ_ПредметыСнабжения.ЗаполнятьДанные)
		|				И ТипЦены = ЗНАЧЕНИЕ(Перечисление.ТипыЦен.Внутренняя)
		|				И Регистратор.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрактов.КоммерческоеПредложение)) КАК ЦеныПредметовСнабженияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныСрезПоследних.ПредметСнабжения КАК ПредметСнабжения,
		|	ЦеныСрезПоследних.КлючАналитики.Продавец КАК КлючАналитикиПродавец,
		|	ЦеныСрезПоследних.Цена КАК Цена,
		|	ЦеныСрезПоследних.Валюта КАК Валюта,
		|	ЦеныСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(
		|			,
		|			ПредметСнабжения В
		|					(ВЫБРАТЬ
		|						ВТ_ПредметыСнабжения.ПредметСнабжения
		|					ИЗ
		|						ВТ_ПредметыСнабжения
		|					ГДЕ
		|						ВТ_ПредметыСнабжения.ЗаполнятьДанные)
		|				И ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.Конкурентная)
		|				И Цена > 0) КАК ЦеныСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_ПредметыСнабжения.ЗаполнятьДанные
		|			ТОГДА ВТ_ПредметыСнабжения.ПредметСнабжения
		|		ИНАЧЕ ВТ_ПредметыСнабжения.НаименованиеПСИзЗаявки
		|	КОНЕЦ КАК НаименованиеПС,
		|	ВТ_ПредметыСнабжения.ЗаполнятьДанные КАК ЗаполнятьДанные,
		|	ВТ_ПредметыСнабжения.НомерСтроки КАК НомерСтроки,
		|	ВТ_ПредметыСнабжения.ПредметСнабжения.Обозначение КАК ОбозначениеПС,
		|	ВТ_ПредметыСнабжения.ПредметСнабжения.ДокументНаПоставку КАК ДокументПоставки
		|ИЗ
		|	ВТ_ПредметыСнабжения КАК ВТ_ПредметыСнабжения
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	#КонецОбласти		
	Запрос.УстановитьПараметр("Заявка", 		Заявка);
	Запрос.УстановитьПараметр("Флот", 			Заявка.ЗапросТКПRFP.Заказчик.ВМС);
	Запрос.УстановитьПараметр("Неопределено", 	Справочники.ПроектыКораблей.НайтиПоНаименованию("Не определено", Истина));
	
	Результ = Запрос.ВыполнитьПакет();
	
	Возврат Результ;
	
КонецФункции //ВыполнитьПакетныйЗапросПечати
#КонецОбласти

///////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПечатьНаСервере(Заявка) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МакетЗаявка = ПолучитьМакет("Заявка");
	
	ОбластьШапка 			= МакетЗаявка.ПолучитьОбласть("Шапка"); 
	ОбластьСтрокаОсновное 	= МакетЗаявка.ПолучитьОбласть("СтрокаОсновное");
	ОбластьСтрокаАналоги	= МакетЗаявка.ПолучитьОбласть("СтрокаАналоги");
	ОбластьСтрокаПоставщики	= МакетЗаявка.ПолучитьОбласть("СтрокаПоставщики");
	ОбластьСтрокаКП			= МакетЗаявка.ПолучитьОбласть("СтрокаКоммерческоеПредложение");
	ОбластьСтрокаТендер		= МакетЗаявка.ПолучитьОбласть("СтрокаТендер");
	ОбластьПустаяСтрока		= МакетЗаявка.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПустойТендер		= МакетЗаявка.ПолучитьОбласть("ПустойТендер");
	ОбластьИмяЗаявки		= МакетЗаявка.ПолучитьОбласть("ИмяЗаявки");
	
	ТабличныйДокумент.Вывести(ОбластьИмяЗаявки);
	ТабличныйДокумент.Вывести(ОбластьШапка);
		
	Результ = ВыполнитьПакетныйЗапросПечати(Заявка);
	
	Проекты 	= Результ[1].Выгрузить();
	Аналоги 	= Результ[2].Выгрузить();
	Поставщики 	= Результ[3].Выгрузить();
	КП 			= Результ[4].Выгрузить();
	Тендеры 	= Результ[5].Выгрузить();
	ЗаявкаПС	= Результ[6].Выгрузить();
	
	НачалоОсновная 	= 3;
	КонецОсновная	= 3;
	
	Для Каждого стрПС Из ЗаявкаПС Цикл
		
		КоличествоКП 		= 0;
		КоличествоТендеров 	= 0;
		МаксСтрок			= 0;
		НачалоКП			= 0;
		КонецКП				= 0;
		НачалоТренд			= 0;
		КонецТренд			= 0;
		
		ОбластьСтрокаОсновное.Параметры.Заполнить(стрПС);
		
		Если стрПС.ЗаполнятьДанные Тогда 
			СтрокаПроекты 		= ПолучитьСтрокуПроектов(стрПС.НаименованиеПС, Проекты);
			СтрокаАналог 		= ПолучитьСтрокуАналог(стрПС.НаименованиеПС, Аналоги);
			СтрокаПоставщики 	= ПолучитьСтрокуПоставщик(стрПС.НаименованиеПС, Поставщики);
		Иначе
			СтрокаПроекты 		= "";
			СтрокаАналог 		= "";
			СтрокаПоставщики 	= "";
		КонецЕсли;
		
		ОбластьСтрокаОсновное.Параметры.Применяемость 				= СтрокаПроекты;
		ОбластьСтрокаАналоги.Параметры.Аналог 						= СтрокаАналог;
		ОбластьСтрокаПоставщики.Параметры.ПоставщикиИИзготовители 	= СтрокаПоставщики;
		
		ТабличныйДокумент.Вывести(ОбластьСтрокаОсновное);
		ТабличныйДокумент.Присоединить(ОбластьСтрокаАналоги);
		ТабличныйДокумент.Присоединить(ОбластьСтрокаПоставщики);
		
		//объединение для тендеров и комерческих предложений
		Если стрПС.ЗаполнятьДанные Тогда 
			
			НайденныеКП 		= КП.НайтиСтроки(Новый Структура("ПредметСнабжения", стрПС.НаименованиеПС)); 
			КоличествоКП 		= НайденныеКП.Количество();
			
			НайденныеТендеры 	= Тендеры.НайтиСтроки(Новый Структура("ПредметСнабжения", стрПС.НаименованиеПС));
			КоличествоТендеров	= НайденныеТендеры.Количество();
			
			Если КоличествоКП > 0 Или КоличествоТендеров > 0 Тогда
				
				НачалоОсновная 	= ТабличныйДокумент.ВысотаТаблицы;
				КонецОсновная	= НачалоОсновная - 1;
				
				МаксСтрок = Макс(КоличествоКП, КоличествоТендеров);
				
				Для Счет = 0 По МаксСтрок-1 Цикл
					
					Если Счет > 0 Тогда
						ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
					КонецЕсли;
					
					Если КоличествоКП > Счет Тогда
						ОбластьСтрокаКП.Параметры.Контрагент 	= НайденныеКП[Счет].Контрагент;
						ОбластьСтрокаКП.Параметры.ЦенаИВалюта 	= "" +НайденныеКП[Счет].Цена + " (" + НайденныеКП[Счет].Валюта + ")";
						ОбластьСтрокаКП.Параметры.Дата 			= Формат(НайденныеКП[Счет].Период, "ДФ=dd.MM.yy");
						
						НачалоКП = ТабличныйДокумент.ВысотаТаблицы;
						КонецКП = НачалоКП;
					Иначе
						ОбластьСтрокаКП.Параметры.Контрагент 	= "";
						ОбластьСтрокаКП.Параметры.ЦенаИВалюта 	= "";
						ОбластьСтрокаКП.Параметры.Дата 			= "";
						Если НачалоКП = 0 Тогда
							НачалоКП = ТабличныйДокумент.ВысотаТаблицы;	
						КонецЕсли;
						КонецКП = ТабличныйДокумент.ВысотаТаблицы;
					КонецЕсли;
					Если КоличествоТендеров > Счет Тогда
						ОбластьСтрокаТендер.Параметры.Контрагент 	= НайденныеТендеры[Счет].КлючАналитикиПродавец;
						ОбластьСтрокаТендер.Параметры.ЦенаИВалюта 	= "" +НайденныеТендеры[Счет].Цена + " (" + НайденныеТендеры[Счет].Валюта + ")";
						ОбластьСтрокаТендер.Параметры.Дата 			= Формат(НайденныеТендеры[Счет].Период, "ДФ=dd.MM.yy");
						НачалоТренд = ТабличныйДокумент.ВысотаТаблицы;
						КонецТренд 	= НачалоТренд;
					Иначе
						ОбластьСтрокаТендер.Параметры.Контрагент 	= "";
						ОбластьСтрокаТендер.Параметры.ЦенаИВалюта 	= "";
						ОбластьСтрокаТендер.Параметры.Дата 			= "";
						Если НачалоТренд = 0 Тогда
							НачалоТренд = ТабличныйДокумент.ВысотаТаблицы;
						КонецЕсли;
						КонецТренд = ТабличныйДокумент.ВысотаТаблицы;
					КонецЕсли;
					
					ТабличныйДокумент.Присоединить(ОбластьСтрокаКП);
					ТабличныйДокумент.Присоединить(ОбластьСтрокаТендер);
					
					КонецОсновная = КонецОсновная + 1;
					
				КонецЦикла;
				
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C1:R" + КонецОсновная + "C1").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C2:R" + КонецОсновная + "C2").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C3:R" + КонецОсновная + "C3").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C4:R" + КонецОсновная + "C4").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C5:R" + КонецОсновная + "C5").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C6:R" + КонецОсновная + "C6").Объединить();
				ТабличныйДокумент.Область("R" + НачалоОсновная + "C7:R" + КонецОсновная + "C7").Объединить();
				
				ТабличныйДокумент.Область("R" + НачалоКП + "C8:R" + КонецКП + "C8").Объединить();
				ТабличныйДокумент.Область("R" + НачалоКП + "C9:R" + КонецКП + "C9").Объединить();
				ТабличныйДокумент.Область("R" + НачалоКП + "C10:R" + КонецКП + "C10").Объединить();
				
				ТабличныйДокумент.Область("R" + НачалоТренд + "C11:R" + КонецТренд + "C11").Объединить();
				ТабличныйДокумент.Область("R" + НачалоТренд + "C12:R" + КонецТренд + "C12").Объединить();
				ТабличныйДокумент.Область("R" + НачалоТренд + "C13:R" + КонецТренд + "C13").Объединить();
			Иначе	
				ТабличныйДокумент.Присоединить(ОбластьПустойТендер);
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Присоединить(ОбластьПустойТендер);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = ложь;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	//ПечатьНаСервере
